app/models/user.rb

    def reset_session_token!
        generate_unique_session_token
        self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "zjFUG_95NF8Gc-z1Y0fAHQ"], ["updated_at", "2019-12-20 20:39:19.959000"], ["id", 4]]